Revit 2026 API

# LabelUtilsGetLabelFor(DuctLossMethodType, Document) Method

---

Gets the user-visible name for a DuctLossMethodType.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static string GetLabelFor(
	DuctLossMethodType ductLossMethodType,
	Document doc
)
```
```vb
Public Shared Function GetLabelFor (
	ductLossMethodType As DuctLossMethodType,
	doc As Document
) As String
```
```cpp
public:
static String^ GetLabelFor(
	DuctLossMethodType ductLossMethodType,
	Document^ doc
)
```
```fsharp
static member GetLabelFor :
        ductLossMethodType : DuctLossMethodType *
        doc : Document -> string
```

#### Parameters

ductLossMethodType DuctLossMethodType
     The DuctLossMethodType to get the user-visible name.
doc Document
     The document from which to get the DuctLossMethodType.

#### Return Value

String

| Exception | Condition |
| --- | --- |
| InvalidOperationException | Thrown when information for the input DuctLossMethodType cannot be found. |

The name is obtained in the current Revit language.

#### Reference

LabelUtils Class

GetLabelFor Overload

Autodesk.Revit.DB Namespace